Tekla Open API Reference for Tekla Structures 2025
UserPropertyOption.DoubleValue Property
 The double value.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double DoubleValue { get; set; }
Public Property DoubleValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
UserPropertyOption Class
Tekla.Structures.Catalogs Namespace